## Formatting the data (food price)

In [1]:
import pandas as pd

### Import data in .csv format and delete unnecessary data

In [2]:
df = pd.read_csv('prc_hicp_midx_page_linear.csv')
# source: https://ec.europa.eu/eurostat/databrowser/view/PRC_HICP_MIDX__custom_7096031/default/table?lang=en

In [3]:
df.head(1)

,DATAFLOW,LAST UPDATE,freq,unit,coicop,geo,TIME_PERIOD,OBS_VALUE,OBS_FLAG
0,ESTAT:PRC_HICP_MIDX(1.0),31/07/23 11:00:00,M,I15,CP011,DE,1996-01,74.9,NaN

In [4]:
df.drop('unit',axis=1,inplace=True)
df.drop('DATAFLOW',axis=1,inplace=True)
df.drop('LAST UPDATE',axis=1,inplace=True)
df.drop('freq',axis=1,inplace=True)
df.drop('coicop',axis=1,inplace=True)
df.drop('OBS_FLAG',axis=1,inplace=True)
df.drop('geo',axis=1,inplace=True)

In [5]:
df.head(1)

  TIME_PERIOD  OBS_VALUE
0     1996-01       74.9

### Adjustment of column names

In [6]:
df.rename(columns={'TIME_PERIOD': 'Time'}, inplace=True)
df.rename(columns={'OBS_VALUE': 'Food_Price'}, inplace=True)

In [7]:
df.head(1)

      Time  Food_Price
0  1996-01        74.9

In [8]:
df.dtypes

Time           object
Food_Price    float64
dtype: object

### Saving the data

In [9]:
df.to_csv('data_food_price.csv')

In [10]:
df.head()

      Time  Food_Price
0  1996-01        74.9
1  1996-02        75.5
2  1996-03        76.1
3  1996-04        76.4
4  1996-05        76.2